In [1]:
import pandas as pd

In [9]:
file = 'https://raw.githubusercontent.com/alamhanz/pandas_journey/main/mydata/food_delivery_datasets.csv'
dataset = pd.read_csv(file, sep=',')
dataset.head()

,order_id,voucher_amount,date_time,eta_seconds,food_price,cust_id,rating,delivery_fee,resto_id,status,random_id
0,FOOD-10455,0,2018-08-12T20:35:08.001006,1800,18900,1089034,5.0,4000,742638033,Completed,0.511149
1,FOOD-10985,0,2018-09-23T17:44:12.243273,2173,149000,180146,5.0,11000,742767245,Completed,0.832936
2,FOOD-10911,0,2018-09-19T18:08:09.387991,1418,43800,366528,NaN,9000,742618303,Completed,0.828026
3,FOOD-10932,0,2018-09-21T01:24:35.272499,1903,39900,511038,5.0,14000,742541172,Completed,0.239377
4,FOOD-10961,0,2018-09-22T17:57:45.523161,1716,77700,1220358,NaN,4000,742604875,Completed,0.995587

In [ ]:
#Q1 Mencari rata-rata harga makanan yang memiliki rating di atas 3.

In [15]:
Q_1 = dataset[['food_price', 'rating']] #Menampilkan kolom food price dan rating
Q_1.head()

   food_price  rating
0       18900     5.0
1      149000     5.0
2       43800     NaN
3       39900     5.0
4       77700     NaN

In [16]:
df_rating = Q_1[Q_1['rating']>3] #filter data yang mempunyai rating di atas 3
df_rating.head()

   food_price  rating
0       18900     5.0
1      149000     5.0
3       39900     5.0
5      138800     5.0
6       58700     5.0

In [17]:
df_rating['food_price'].mean() #menghitung rata rata harga makanan yang mempunyai rating di atas 3

76680.06756756757

In [ ]:
#Maka rata-rata harga makanan yang memiliki rating di atas 3 adalah Rp76.680

In [ ]:
#Q2 Mencari ongkos kirim tertinggi, ongkos kirim terendah, dan rata-rata ongkos kirim untuk makanan yang harganya di atas Rp100.000

In [19]:
Q_2 = dataset[['food_price', 'delivery_fee']] #Menampilkan kolom food price dan delivery_fee
Q_2.head()

   food_price  delivery_fee
0       18900          4000
1      149000         11000
2       43800          9000
3       39900         14000
4       77700          4000

In [20]:
df_delivery_fee = Q_2[Q_2['food_price']>100000] #filter data yang mempunyai harga makanan di atas 100.000
df_delivery_fee.head()

    food_price  delivery_fee
1       149000         11000
5       138800         10000
10      437800         12000
13      339800         13000
21      131000          5000

In [23]:
df_delivery_fee['delivery_fee'].max() #menghitung ongkos kirim tertinggi yang mempunyai harga makanan di atas 100.000

44000

In [24]:
df_delivery_fee['delivery_fee'].min() #menghitung ongkos kirim terendah yang mempunyai harga makanan di atas 100.000

0

In [22]:
df_delivery_fee['delivery_fee'].mean() #menghitung rata rata ongkos kirim yang mempunyai harga makanan di atas 100.000

11184.782608695652

In [ ]:
#Maka ongkos kirim tertinggi untuk makanan dengan harga di atas Rp100.000 adalah Rp44.000
#Ongkos kirim terendah untuk makanan dengan harga di atas Rp100.000 adalah Rp0
#Rata-rata ongkos kirim untuk makanan dengan harga di atas Rp100.000 adalah Rp11.185